# AceleraDev Codenation - Semana 2

### Túlio Vieira de Souza | Data Scientist

## Manipulando dados

### Dicionarios

In [2]:
#Importando os pacotes
import pandas as pd
import numpy as np

In [ ]:
#acessando o help dos pacotes
pd?

In [222]:
#Criando um dicionário com os dados
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300 ]}

In [223]:
#para printar o dicionáario
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [224]:
#verificando o tipo do dicionario
type(dados)

dict

In [225]:
#Acessando as chaves do meu dicionario
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [226]:
#Acessando uma chave especifica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [227]:
#Acessando uma posicao especifica de um dicionario
dados['acessos'][2]

300

In [228]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][2]

'instagram'

In [229]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

### Listas

In [230]:
type([1,2,3])

list

In [231]:
#Criando uma lista
lista = [200, 200 , 300 ,800, 200]

In [232]:
#printando a lista
lista

[200, 200, 300, 800, 200]

In [233]:
#Vendo valores especificos
lista[1]

200

In [234]:
#fatia da lista
lista[:3]

[200, 200, 300]

In [235]:
# Adicionando a lista ao dicionario 
dados['lista'] = lista

In [236]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames

In [242]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

In [243]:
#Criar um data frame a partir de um dict
dtfm = pd.DataFrame(dados)

In [244]:
#acessando o dataframe
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [245]:
#printando os primeiros casos do dataframe
dtfm.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

In [246]:
#Verificando o formato do dataframe
dtfm.shape

(5, 5)

In [247]:
#Verificando o indice do dataframe
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [258]:
#Verificando os tipos dos dados do dataframe
dtfm.dtypes#.value_counts()

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [273]:
#Verificando se existem valores faltantes
dtfm.isna()#.sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
nova_coluna    0
dtype: int64

In [254]:
#printando os nomes das colunas
dtfm.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [267]:
#Acessando uma coluna especifica
#list(dtfm['canal_venda'])
dtfm['canal_venda']

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [270]:
# Criando uma nova coluna
dtfm['nova_coluna'] = [1, 2, 3, 4, '']

In [308]:
dtfm

  canal_venda  acessos   site   vendas  lista nova_coluna
0    facebook      100  site1  1000.52    200           1
1     twitter      200  site1  1052.34    200           2
2   instagram      300  site2  2002.00    300           3
3    linkedin      400  site2  5000.00    800           4
4    facebook      500  site3   300.00    200

In [310]:
dtfm.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [314]:
# Removendo colunas
dtfm.drop(columns = 'nova_coluna', inplace=True)

In [315]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [319]:
dtfm.drop(columns=['lista', 'site'])

  canal_venda  acessos   vendas
0    facebook      100  1000.52
1     twitter      200  1052.34
2   instagram      300  2002.00
3    linkedin      400  5000.00
4    facebook      500   300.00

In [333]:
#Mostrando as colunas
dtfm.set_index('acessos').index

Int64Index([100, 200, 300, 400, 500], dtype='int64', name='acessos')

In [334]:
#Acessando valores especificos
dtfm['acessos'][1]

200

In [336]:
#Acessando fatia de coluna especifica
dtfm['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [337]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [339]:
### Fatiando os dados usando o iloc (linhas | colunas)
dtfm.iloc[3:,4:]

   lista
3    800
4    200

In [345]:
dtfm[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300

In [346]:
#Fatiar os dados usando o loc (indice)
dtfm.loc[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800

In [348]:
#Selecionando colunas especificas
dtfm[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [349]:
#Passando os valores atraves de lista
filtro = ['canal_venda', 'acessos']

In [356]:
dtfm[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [372]:
# Usando o metodo info()
dtfm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      float64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
dtypes: float64(2), int64(1), object(2)
memory usage: 328.0+ bytes

In [401]:
#Pivotando os dados (coluna)
aux = dtfm.pivot(index = 'canal_venda', columns='site', values='acessos')

In [373]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [403]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [402]:
aux

site         site1  site2  site3
canal_venda
facebook     100.0    NaN  500.0
instagram      NaN  300.0    NaN
linkedin       NaN  400.0    NaN
twitter      200.0    NaN    NaN

In [404]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (coluna)
dtfm.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
aux= aux.fillna(0)
aux

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [405]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [449]:
# Mudando as colunas usando o comando melt
dtfm.melt(id_vars=['site'], value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [407]:
#Resetando o indice do dataframe
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['canal_venda', 'site1', 'site2', 'site3'], dtype='object', name='site')

In [408]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [409]:
aux = dtfm.reset_index()
aux

   index canal_venda  acessos   site   vendas  lista
0      0    facebook    100.0  site1  1000.52    200
1      1     twitter    200.0  site1  1052.34    200
2      2   instagram    300.0  site2  2002.00    300
3      3    linkedin    400.0  site2  5000.00    800
4      4    facebook    500.0  site3   300.00    200

In [451]:
aux = dtfm.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
aux = aux.reset_index()
aux

site canal_venda  site1  site2  site3
0       facebook  100.0    0.0  500.0
1      instagram    0.0  300.0    0.0
2       linkedin    0.0  400.0    0.0
3        twitter  200.0    0.0    0.0

In [410]:
aux.reset_index()

   level_0  index canal_venda  acessos   site   vendas  lista
0        0      0    facebook    100.0  site1  1000.52    200
1        1      1     twitter    200.0  site1  1052.34    200
2        2      2   instagram    300.0  site2  2002.00    300
3        3      3    linkedin    400.0  site2  5000.00    800
4        4      4    facebook    500.0  site3   300.00    200

In [454]:
#Exemplo do comando melt
#aux.index
aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2', 'site3'])

   canal_venda   site  value
0     facebook  site1  100.0
1    instagram  site1    0.0
2     linkedin  site1    0.0
3      twitter  site1  200.0
4     facebook  site2    0.0
5    instagram  site2  300.0
6     linkedin  site2  400.0
7      twitter  site2    0.0
8     facebook  site3  500.0
9    instagram  site3    0.0
10    linkedin  site3    0.0
11     twitter  site3    0.0

In [455]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [465]:
#Somando (Concatenando para strings) as colunas do dataframe
dtfm[['vendas', 'acessos', 'lista']].sum()

vendas     9354.86
acessos    1500.00
lista      1700.00
dtype: float64

In [466]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [467]:
#Somando as linhas do dataframe
dtfm.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [469]:
#Calculando a mediana das colunas numericas
print('Por linha: ',dtfm.median(axis= 1) )
print('Por coluna: ', dtfm.median())

Por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Por coluna:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [470]:
#Calculando a media das colunas númericas
dtfm.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [471]:
#Calculando o desvio padrão das colunas numericas
dtfm.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [473]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dtfm.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [474]:
#Calculando a moda
dtfm.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1   300.00  200.0
1         NaN    200.0  site2  1000.52    NaN
2         NaN    300.0    NaN  1052.34    NaN
3         NaN    400.0    NaN  2002.00    NaN
4         NaN    500.0    NaN  5000.00    NaN

In [475]:
# Valor maximo por coluna
dtfm.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
dtype: object

In [476]:
#Valor minimo por coluna
dtfm.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
dtype: object

In [477]:
#Printando a quantidade de unicos (variabilidade)
dtfm.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

In [478]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [479]:
#Contando numeros de repatições de um valor unico de uma coluna
dtfm['canal_venda'].value_counts()

facebook     2
twitter      1
instagram    1
linkedin     1
Name: canal_venda, dtype: int64

In [481]:
#Valores unicos de uma coluna
dtfm['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [482]:
# Usando o groupby com valores numericos
dtfm.groupby('site')['acessos'].sum()

site
site1    300.0
site2    700.0
site3    500.0
Name: acessos, dtype: float64

In [487]:
# Usando o groupby com valores numericos
dtfm.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300.0
instagram    300.0
linkedin     400.0
twitter      200.0
Name: acessos, dtype: float64

In [488]:
# Usando o groupby com categoricos
dtfm.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [489]:
# Usando o groupby com categoricos
dtfm.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [490]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [491]:
#Usando o groupby com a função agg
dtfm.groupby('canal_venda').agg({'site': 'unique',
                                     'acessos': 'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]    600.0
instagram           [site2]    300.0
linkedin            [site2]    400.0
twitter             [site1]    200.0

In [530]:
#Correlações entre variaveis
dtfm.corr(method = 'pearson')

          acessos    vendas     lista
acessos  1.000000  0.217542  0.363803
vendas   0.217542  1.000000  0.979211
lista    0.363803  0.979211  1.000000

In [498]:
dtfm.groupby(by='site').agg({'canal_venda':'unique','acessos':'sum'})

                 canal_venda  acessos
site
site1    [facebook, twitter]    300.0
site2  [instagram, linkedin]    700.0
site3             [facebook]    500.0

In [501]:
dtfm

  canal_venda  acessos   site   vendas  lista
0    facebook    100.0  site1  1000.52    200
1     twitter    200.0  site1  1052.34    200
2   instagram    300.0  site2  2002.00    300
3    linkedin    400.0  site2  5000.00    800
4    facebook    500.0  site3   300.00    200

In [518]:
#Criando variaveis categoricas por fatia de variavel numerica
dtfm['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 3000, 5000), 
                                       labels = ('fraco', 'bom', 'excelente'))

In [519]:
dtfm

  canal_venda  acessos   site   vendas  lista categoria_vendas
0    facebook    100.0  site1  1000.52    200            fraco
1     twitter    200.0  site1  1052.34    200            fraco
2   instagram    300.0  site2  2002.00    300              bom
3    linkedin    400.0  site2  5000.00    800        excelente
4    facebook    500.0  site3   300.00    200            fraco

In [524]:
#Criando variavel categorica usando compressao de lista
dtfm['cat_acessos'] = ['baixo' if x < 300 else 'alto' for x in dataframe['acessos']]

In [525]:
dtfm

  canal_venda  acessos   site   vendas  lista categoria_vendas cat_acessos
0    facebook    100.0  site1  1000.52    200            fraco       baixo
1     twitter    200.0  site1  1052.34    200            fraco       baixo
2   instagram    300.0  site2  2002.00    300              bom        alto
3    linkedin    400.0  site2  5000.00    800        excelente        alto
4    facebook    500.0  site3   300.00    200            fraco        alto

In [531]:
#Juntando dois dataframes | Criando o dataframe_2
dtfm_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [540]:
#Realizando o merge
dtfm.merge(dtfm_2, on = 'site', how='left' )

,canal_venda,acessos,site,vendas,lista,categoria_vendas,cat_acessos,suporte
0,facebook,100.0,site1,1000.52,200,fraco,baixo,Carlos
1,facebook,100.0,site1,1000.52,200,fraco,baixo,Carlos
2,twitter,200.0,site1,1052.34,200,fraco,baixo,Carlos
3,twitter,200.0,site1,1052.34,200,fraco,baixo,Carlos
4,instagram,300.0,site2,2002.00,300,bom,alto,Maria
5,instagram,300.0,site2,2002.00,300,bom,alto,Maria
6,linkedin,400.0,site2,5000.00,800,excelente,alto,Maria
7,linkedin,400.0,site2,5000.00,800,excelente,alto,Maria
8,facebook,500.0,site3,300.00,200,fraco,alto,Ezequiel

In [558]:
#Salvando o dataframe como csv
dtfm.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)
dtfm

  canal_venda  acessos   site   vendas  lista categoria_vendas cat_acessos
0    facebook    100.0  site1  1000.52    200            fraco       baixo
1     twitter    200.0  site1  1052.34    200            fraco       baixo
2   instagram    300.0  site2  2002.00    300              bom        alto
3    linkedin    400.0  site2  5000.00    800        excelente        alto
4    facebook    500.0  site3   300.00    200            fraco        alto

In [561]:
#Lendo dados no formato csv
dtfm = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [562]:
dtfm.head()

  canal_venda  acessos   site   vendas  lista categoria_vendas cat_acessos
0    facebook    100.0  site1  1000.52    200            fraco       baixo
1     twitter    200.0  site1  1052.34    200            fraco       baixo
2   instagram    300.0  site2  2002.00    300              bom        alto
3    linkedin    400.0  site2  5000.00    800        excelente        alto
4    facebook    500.0  site3   300.00    200            fraco        alto

In [563]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [572]:
json['offers'][99]

{'offerCode': 'AmazonLex',
 'versionIndexUrl': '/offers/v1.0/aws/AmazonLex/index.json',
 'currentVersionUrl': '/offers/v1.0/aws/AmazonLex/current/index.json',
 'currentRegionIndexUrl': '/offers/v1.0/aws/AmazonLex/current/region_index.json'}

In [566]:
json.shape

(153, 4)

In [568]:
json.info()

<class 'pandas.core.frame.DataFrame'>
Index: 153 entries, A4B to translate
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   formatVersion    153 non-null    object
 1   disclaimer       153 non-null    object
 2   publicationDate  153 non-null    object
 3   offers           153 non-null    object
dtypes: object(4)
memory usage: 11.0+ KB

In [571]:
json.describe()

,formatVersion,disclaimer,publicationDate,offers
count,153,153,153,153
unique,1,1,1,153
top,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'AWSTransfer', 'versionIndexUrl'..."
freq,153,153,153,1

In [575]:
json

,index,formatVersion,disclaimer,publicationDate,offers
0,A4B,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'A4B', 'versionIndexUrl': '/offe..."
1,AWSAmplify,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'AWSAmplify', 'versionIndexUrl':..."
2,AWSAppSync,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'AWSAppSync', 'versionIndexUrl':..."
3,AWSBackup,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'AWSBackup', 'versionIndexUrl': ..."
4,AWSBudgets,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'AWSBudgets', 'versionIndexUrl':..."
...,...,...,...,...,...
148,comprehendmedical,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'comprehendmedical', 'versionInd..."
149,datapipeline,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'datapipeline', 'versionIndexUrl..."
150,mobileanalytics,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'mobileanalytics', 'versionIndex..."
151,transcribe,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'transcribe', 'versionIndexUrl':..."
152,translate,v1.0,This pricing list is for informational purpose...,2020-06-17T16:47:42Z,"{'offerCode': 'translate', 'versionIndexUrl': ..."

In [574]:
json.reset_index(inplace = True)

In [576]:
json['index']

0                    A4B
1             AWSAmplify
2             AWSAppSync
3              AWSBackup
4             AWSBudgets
             ...
148    comprehendmedical
149         datapipeline
150      mobileanalytics
151           transcribe
152            translate
Name: index, Length: 153, dtype: object

## Imputação de dados

In [ ]:
df = pd.read_csv('train.csv')

In [ ]:
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})

In [ ]:
aux

In [ ]:
#Dados númericos : média ou mediana
df['Age'] = df['Age'].fillna(df['Age'].mode())

In [ ]:
#Dados categoricos: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [ ]:
df['Cabin'].value_counts()

In [ ]:
df.shape[0]

#novos testes

In [3]:
import pandas as pd

In [4]:
# gylow: teste novo
test = pd.read_csv('IRIS.csv')

In [6]:
test.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [14]:
aux = pd.DataFrame({'colunas': test.columns,'tipos': test.dtypes, 'NA #': test.isna().sum(), 'NA %': (test.isna().sum()/test.shape[0]*100)})

In [16]:
aux

                   colunas    tipos  NA #  NA %
sepal_length  sepal_length  float64     0   0.0
sepal_width    sepal_width  float64     0   0.0
petal_length  petal_length  float64     0   0.0
petal_width    petal_width  float64     0   0.0
species            species   object     0   0.0

In [27]:
aux[aux['tipos'] == "float64"]['colunas']

sepal_length    sepal_length
sepal_width      sepal_width
petal_length    petal_length
petal_width      petal_width
Name: colunas, dtype: object

In [29]:
list(aux[aux['tipos'] == "float64"]['colunas'])

['sepal_length', 'sepal_width', 'petal_length', 'petal_width']

In [35]:
list(aux[aux['NA %'] == 0]['colunas'])

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']